_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Comment>ИО пользователя на данной роли</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыАдресацийРолейВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыАдресацийРолейВизирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаправлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура РольПриИзменении(Элемент)
	ОраничитьТипПодразделение();
КонецПроцедуры

&НаСервере
Процедура ОраничитьТипПодразделение()
	
	Если Запись.Роль.ВидАдресации = Перечисления.ВидыАдресацийРолейВизирования.ПоОрганизации Тогда 
		ЭтаФорма.Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
		ЭтаФорма.Элементы.Подразделение.Заголовок		= "Организации";                                      
	ИначеЕсли Запись.Роль.ВидАдресации = Перечисления.ВидыАдресацийРолейВизирования.ПоНаправлению Тогда 
		ЭтаФорма.Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Направления");
		ЭтаФорма.Элементы.Подразделение.Заголовок		= "Направления";
	Иначе //Подразделение 
		ЭтаФорма.Элементы.Подразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
		ЭтаФорма.Элементы.Подразделение.Заголовок		= "Подразделения";
	КонецЕсли;
	
	Запись.Объект = ЭтаФорма.Элементы.Подразделение.ОграничениеТипа.ПривестиЗначение(Запись.Объект);
КонецПроцедуры
